<template>
  <div class="order-notice">
    <mt-popup class="order-notice-popup" position="bottom" v-model="active">
      <article rule="1234" v-show="rule === '1234'">
        <p class="title">购票说明</p>
        <p>1. 云快报合作商家通过铁路官方网站或授权代售点为您提供火车票代购服务； </p>
        <p>2. 因全国各铁路局规定与要求不同，无法承诺百分百代购成功，若代购失败，订单金额将全额退还至您的支付账户，1-7 个工作日到账。</p>
        <p class="title">取票说明</p>
        <p>1. 电子票：请持购票所使用有效身份证件原件在开车前到火车站售票窗口、铁路客票代售点或车站自动取票机办理换票手续； </p>
        <p>2. 纸质票：纸质票由快递员送票上门，不需要取票； </p>
        <p>3. 部分高铁动车组列车，可持二代身份证直接检票进站。</p>
        <p class="title">如何办理在线改签</p>
        <p>
          1. 在云快报购票后，没有换取纸质车票且不晚于开车前30分钟的，可以在“云快报-我的订单”办理改签；已经换取纸质车票或者在开车前 30 分钟内的，请到车站售票窗口办理；</p>
        <p>2. 在有运输能力的前提下，开车前 48 小时（不含）以上，可改签预售期内的其他列车。
开车前 48 小时以内，可改签开车前的其他列车，也可改签开车后至票面日期当日 24:00 之间的其他列车，不办理票面日期次日及以后的改签。</p>
        <p class="title">如何办理线下改签</p>
        <p>开车之后，旅客仍可改签当日其他列车，但只能在票面发站办理改签。已经办理“变更到站”的车票，不再办理改签。
开车前 48 小时～15 天期间内，改签至距开车 15 天以上的其他列车，又在距开车 15 天前退票的，仍核收 5% 的退票费。
改签或变更到站后的车票乘车日期在春运期间的，退票时一律按开车时间前不足 24 小时标准核收退票费。</p>
        <p class="title">改签相关费用及退款标准</p>
        <p>按购票时所使用的在线支付工具相关规定，改签时，新车票票价高于原车票时，将支付新票全额票款，且原票款在规定时间退回原购票时所使用的在线支付工具；
新车票票价低于原车票的，退还差额，对差额部分核收退票费并执行现行退票费标准，应退票款在规定时间退回原购票时所使用的在线支付工具；
新车票票价等于原车票的，无需支付；
每次改签，云快报收取 5 元服务费。</p>
        <p class="title">改签变成到站</p>
        <p>在云快报购票后，没有换取纸质车票且不晚于开车前 30 分钟的，可以在“云快报-我的订单”办理改签；，在有运输能力的前提下，可在改签功能中变更“目的地”；已经取得纸质车票的，请在车站指定售票窗口办理。
对已改签车票、团体票及通票暂不提供“变更到站”服务。
开车前 48 小时～15 天期间内，“变更到站”至距开车 15 天以上的其他列车，又在距开车 15 天前退票的，仍核收 5% 的退票费。</p>
        <p class="title">如何办理退票</p>
        <p>在云快报购票后，请按以下方式办理退票：</p>
        <p>1. 没有换取纸质车票且不晚于开车前 30 分钟的，可以在“云快报-我的订单”办理退票;</p>
        <p>2. 已经换取纸质车票或者在开车前 30 分钟之内的，请携带购票时所使用的乘车人有效身份证件原件到车站售票窗口办理，居民身份证无法自动识读或者使用居民身份证以外的其他有效身份证件购票的，请提供订单号码（E+9位数字）；</p>
        <p>3. 使用居民身份证购票且持居民身份证办理进站检票后，未乘车即出站的，请经车站确认后按规定办理；</p>
        <p>4. 因伤、病或者承运人责任中途下车的，请凭列车长出具的客运记录和购票时所使用的乘车人有效身份证件原件在下车站按规定办理。</p>
        <p class="title">退票费收取规则</p>
        <p>
          1. 开车前 15天（不含）以上退票的，不收取退票费；票面乘车站开车时间前 48 小时以上的按票价 5% 计，24 小时以上、不足 48 小时的按票价 10% 计，不足 24 小时的按票价 20% 计；
        </p>
        <p>
          2. 开车前 48 小时～15 天期间内，改签或变更到站至距开车 15 天以上的其他列车，又在距开车 15 天前退票的，仍核收 5% 的退票费；
        </p>
        <p>
          3. 办理车票改签或“变更到站”时，新车票票价低于原车票的，退还差额，对差额部分核收退票费并执行现行退票费标准。
          上述计算的尾数以 5 角为单位，尾数小于 2.5 角的舍去、2.5 角以上且小于 7.5 角的计为 5角、7.5 角以上的进为 1 元。退票费最低按 2 元计收。
          改签或变更到站后的车票乘车日期在春运期间的，退票时一律按开车时间前不足 24 小时标准核收退票费。
        </p>
        <p class="title">在线办理退票、改签或“变更到站”时，核收退票费的，如何获取报销凭证？</p>
        <p>
          办理退票、改签或“变更到站”之日起 10 日内，凭购票时所使用的乘车人有效身份证件原件到车站售票窗口索取退票费报销凭证。依据国家发票管理有关规定，旅客可用来报销。
        </p>
        <p class="title">免责说明</p>
        <p>
          1. 云快报提供的是火车票代购服务，您接受本协议，意味着您同意云快报及合作商家使用您填写的乘客信息进行代购，包括但不限于授权我们使用您的乘客信息执行查询、代购、退票、改签、注册等操作，同时您必须遵守12306购票规定的服务条款(https://kyfw.12306.cn/otn/regist/rule)；
        </p>
        <p>
          2. 云快报不对因（1）铁路部门调整车次、票价、坐席等信息；（2）铁路部门调整退票规则、改签规则、售票时间；（3）客户提供错误的订单信息（包括但不限于姓名、身份证号码、日期、车次、坐席）而造成的用户损失承担任何责任，因上述原因、客户自身原因或其他不可抗力发生的退款或差额以铁路部门实退或实收为准。
        </p>
      </article>
      <article rule="6789" v-show="rule === '6789'">
        <p class="title">1.如何办理在线改签？</p>
        <p>
          1) 在云快报购票后，没有换取纸质车票且不晚于开车前30分钟的，可以在“云快报-我的订单”办理改签；已经换取纸质车票或者在开车前30分钟内的，请到车站售票窗口办理。
        </p>
        <p>
          2)在有运输能力的前提下，开车前48小时（不含）以上，可改签预售期内的其他列车；
          开车前48小时以内，可改签开车前的其他列车，也可改签开车后至票面日期当日24:00之间的其他列车，不办理票面日期次日及以后的改签；
        </p>
        <p class="title">2.如何办理线下改签？</p>
        <p>
          开车之后，旅客仍可改签当日其他列车，但只能在票面发站办理改签。已经办理“变更到站”的车票，不再办理改签。
          开车前48小时～15天期间内，改签至距开车15天以上的其他列车，又在距开车15天前退票的，仍核收5%的退票费。
          改签或变更到站后的车票乘车日期在春运期间的，退票时一律按开车时间前不足24小时标准核收退票费。
        </p>
        <p class="title">3.改签相关费用及退款标准</p>
        <p>
          按购票时所使用的在线支付工具相关规定，
          改签时，新车票票价高于原车票时，将支付新票全额票款，且原票款在规定时间退回原购票时所使用的在线支付工具；
          新车票票价低于原车票的，退还差额，对差额部分核收退票费并执行现行退票费标准，应退票款在规定时间退回原购票时所使用的在线支付工具；
          新车票票价等于原车票的，无需支付；
          每次改签，云快报收取5元服务费。
        </p>
        <p class="title">4.改签变更到站</p>
        <p>
          在云快报购票后，没有换取纸质车票且不晚于开车前30分钟的，可以在“云快报-我的订单”办理改签；，在有运输能力的前提下，可在改签功能中变更“目的地”；已经取得纸质车票的，请在车站指定售票窗口办理。
          对已改签车票、团体票及通票暂不提供“变更到站”服务。
          开车前48小时～15天期间内，“变更到站”至距开车15天以上的其他列车，又在距开车15天前退票的，仍核收5%的退票费。
        </p>
      </article>
      <article v-if="rule === 'chineseName'">
        <h3>乘机人中文名填写规范</h3>
        <p>1. 乘客姓名必须与登机时所用证件上的名字一致;</p>
        <p>2. 您填写的姓名中包含有生僻字或繁体字，请从生僻字开始之后的中文都用拼音代替,如：王喆敏，请填写‘王zhemin’。</p>
        <p>3. 姓名过长时请使用缩写,例如“买买提不拉多娜萨日娜阿诺凡”简写为“买买提不拉多娜日娜阿”。</p>
      </article>
      <article v-if="rule === 'passport'">
        <h3>乘机人英文姓名填写规范</h3>
        <p>1. 乘客姓名必须与登机时所用证件上的名字一致;</p>
        <p>2. 若持护照登机，必须按照护照顺序区分姓与名。Middlename填写在Given name（中），不区分大小写。如potter（姓）/joe jerad,在Surname（姓）中填写potter,在Given name（名）中输入joe jerad。</p>
        <p>3. 姓与名总长度≤ 26 个字符,若过长请使用缩写;例如Shekin Khalifa bin Zayed Alyle Nahyan 简写为 Surname: Shekin; Given name: K b Z A Nahyan。</p>
        <p>
          <img src="./images/specifications.png">
        </p>
      </article>
      <div class="bottom-close">
        <ykb-icon :onclick="close" className="close-button" type="cancel" :width="30" :height="30"></ykb-icon>
      </div>
    </mt-popup>
  </div>
</template>

<script>
  import './less/style.less'
  export default {
    name: 'orderNotice',
    props: {
      active: {
        type: Boolean,
        default: false,
        require: false
      },
      rule: String
    },
    data () {
      return {
      }
    },
    methods: {
      close () {
        this.$emit('closeNotice')
      }
    }
  }
</script>
